// ============================================================================
// Installation
// ----------------------------------------------------------------------------
"UEFI.only_title" = "Install for UEFI motherboards";
"UEFI.only_description" = "Install Clover to be used with UEFI motherboards only.";

// ============================================================================
// Target
// ----------------------------------------------------------------------------
"Target.ESP_title" = "Install Clover in the ESP";
"Target.ESP_description" = "Install Clover in the ESP (EFI System Partition) of the target volume

Need to format ESP as Fat32 on Mac first.

For Fat32 use commands like:
diskutil list
newfs_msdos -v EFI -F 32 /dev/rdisk9s1";

// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Bootloader_title" = "Bootloader";
"Bootloader_description" = "簡而言之，Clover EFI 幸運草 需要三個必要的檔案。
boot0 (在硬碟的 MBR) 負責載入 boot1。
boot1 (在分割區的開機磁區 boot-sector) 搜尋 boot2。
boot2 (在分割區的根目錄) 載入 /EFI/BOOT/CLOVERIA32.efi 或 CLOVERX64.efi 及系統核心等等。";

"boot0_title" = "BIOS 安裝 boot0 (HFS+Fat32)";
"boot0_description" = "使用 fdisk440 將 boot0 寫入 MBR 的前 440 位元，避免損壞已經存在的 Windows 機碼，boot0 會在第一個 HFS 啟動 分割區開始搜尋 boot1h2，或在第一個 Fat32 啟動 分割區搜尋 boot1f32alt。
本安裝將 會 設定 HFS 及 Fat32 安裝分割區為啟動分割區。
必須在 Win 先將分割區格式化為 Fat32 格式分割區，或在 Mac 操作如下
  1. 先用 磁碟工具 清除 為 MS-DOS (FAT) 格式
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0hfs_title" = "BIOS 安裝 boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "使用 fdisk440 將 boot0hfs 寫入 MBR 的前 440 位元，避免損壞已經存在的 Windows 機碼，boot0hfs 會在第一個 HFS 分割區開始搜尋 boot1h2，或在第一個 Fat32 啟動 分割區搜尋 boot1f32alt。
本安裝將 不會 設定 HFS 安裝分割區為啟動分割區，
本安裝將 會 設定 Fat32 安裝分割區為啟動分割區。
必須在 Win 先將分割區格式化為 Fat32 格式分割區，或在 Mac 操作如下
  1. 先用 磁碟工具 清除 為 MS-DOS (FAT) 格式
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"bootNo_title" = "Don't update MBR and PBR sectors";
"bootNo_description" = "Don't install any bootloader (boot0X, boot1X).
Usefull for UEFI motherboards that don't need bootloader files.
Can also be use if you don't want to upgrade MBR or PBR sectors.";

"AltBoot_title" = "Use alternative booting PBR";
"AltBoot_description" = "Install alternative booting PBR with choice of boot with a key pressed.
File to boot = boot{keypressed}";


"boot32_title" = "安裝 boot 32位 優先啟動";
"boot32_description" = "安裝 32位+64位 boot 文件，並優先啟用 32位系統。
預設啟動 boot = Clover boot 32位，可在 test done 的 2 秒內，
按 1 選 boot1 = 變色龍 boot，
按 3 選 boot3 = Clover boot 32位，
按 6 選 boot6 = Clover boot 64位。";

"boot64_title" = "安裝 boot 64位 優先啟動";
"boot64_description" = "安裝 32位+64位 boot 文件，並優先啟用 64位系統。
預設啟動 boot = Clover boot 64位，可在 test done 的 2 秒內，
按 1 選 boot1 = 變色龍 boot，
按 3 選 boot3 = Clover boot 32位，
按 6 選 boot6 = Clover boot 64位。";

// ============================================================================
// CloverEFI
// ----------------------------------------------------------------------------
"CloverEFI_title" = "CloverEFI";
"CloverEFI_description" = "Select the version of CloverEFI to install.";
"cloverEFI.32_title" = "CloverEFI 32-bits";
"cloverEFI.32_description" = "CloverEFI 32-bits";
"cloverEFI.64.sata_title" = "CloverEFI 64-bits SATA";
"cloverEFI.64.sata_description" = "CloverEFI 64-bits using SATA to access drives";
"cloverEFI.64.blockio_title" = "CloverEFI 64-bits BiosBlockIO";
"cloverEFI.64.blockio_description" = "CloverEFI 64-bits using Bios Block I/O to access drives";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "開機主題";
"Themes_description" = "選擇安裝，開機時，顯示的背景主題。";

"black_green_title" = "黑綠主題";
"black_green_description" = "預設安裝來自 Blackosx 的黑綠主題，。
安裝位置 /EFI/BOOT/themes/black_green。";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme from Eps,
安裝位置 /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme from mrengles,
安裝位置 /EFI/BOOT/themes/mrengles.";

"iBootloader_title" = "iClover";
"iBootloader_description" = "Grey style theme by winlog,
安裝位置 /EFI/BOOT/themes/iClover.";

"buttons_title" = "按鈕主題";
"buttons_description" = "選擇安裝來自 Trauma 的按鈕主題。
安裝位置 /EFI/BOOT/themes/buttons。";

"hellfire_title" = "地獄火主題";
"hellfire_description" = "選擇安裝來自 illevelll 的地獄火主題。
安裝位置 /EFI/BOOT/themes/hellfire。";

"metal_title" = "金屬主題";
"metal_description" = "原始預設安裝來自 Slice 的金屬主題，現已改由黑綠主題作為預設安裝。
安裝位置 /EFI/BOOT/themes/metal。";

"simple_gray_title" = "簡灰主題";
"simple_gray_description" = "選擇安裝來自 hijeane 的簡灰主題。
安裝位置 /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "原木主題";
"wooden_description" = "選擇安裝來自 iROOTa 的原木主題。
安裝位置 /EFI/BOOT/themes/wooden.";

// ============================================================================
// RC Scripts
// ----------------------------------------------------------------------------
"rc.scripts.on.target_title" = "Install RC scripts on target volume";
"rc.scripts.on.target_description" = "Install all RC scripts on target volume.
The target volume must be a bootable OSX system volume.";
"rc.scripts.on.all.volumes_title" = "Install all RC scripts on all bootable OSX volumes";
"rc.scripts.on.all.volumes_description" = "Install all RC scripts on all internal bootable OSX volumes.";
"Optional RC Scripts" = "Optional RC Scripts";
"disable_sleep_proxy_client_description" = "Disable the mDNSResponder sleep proxy client service. This will prevent the system waking from sleep every hours";

// ----------------------------------------------------------------------------